## Plan Result (shareable-lists-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807465379)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06
  * aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0
* Replace
  * aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438 must be replaced
-/+ resource "aws_sns_topic_subscription" "user-events-sns-subscription_EE3E7438" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f577c3c5-86de-474b-b8d2-db669bce4375" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f577c3c5-86de-474b-b8d2-db669bce4375" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-dlq-policy_CF731C06" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-sqs-policy_C14BCCA0" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"30995768cfe3eb840fc69e2735e0ffbba670a40e","Target":"shareable-lists-api-cdk-production","Vars":{},"WorkflowName":"Shareable Lists API"} -->